# US - Baby Names

### Introduction:

In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this US_Baby_Names_right.csv

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('data/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names[:9]

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns=['Unnamed: 0', 'Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [5]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [7]:
len(baby_names['Name'].unique())

17632

### Step 9. What is the name with most occurrences?

In [8]:
count_names = baby_names['Name'].value_counts()
df_count_names =pd.DataFrame(count_names)
df_count_names.columns = ['Count']
df_count_names

              Count
Riley          1112
Avery          1080
Jordan         1073
Peyton         1064
Hayden         1049
...             ...
Rocsi             1
Eyoel             1
Javeion           1
Ashiyah           1
Carlosdaniel      1

[17632 rows x 1 columns]

### Step 10. How many different names have the least occurrences?

In [9]:
len(df_count_names[df_count_names['Count']== 1])

3682

### Step 11. What is the median name occurrence?

In [10]:
names.mean()['Count']

Name
Aaban       6.000000
Aadan       5.750000
Aadarsh     5.000000
Aaden      17.479592
Aadhav      6.000000
             ...
Zyra        6.000000
Zyrah       5.500000
Zyren       6.000000
Zyria       5.900000
Zyriah      6.444444
Name: Count, Length: 17632, dtype: float64

### Step 12. What is the standard deviation of names?

In [11]:
names.std()['Count']

Name
Aaban       0.000000
Aadan       0.957427
Aadarsh          NaN
Aaden      21.154974
Aadhav           NaN
             ...
Zyra        1.154701
Zyrah       0.707107
Zyren            NaN
Zyria       0.737865
Zyriah      1.666667
Name: Count, Length: 17632, dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
names['Count'].describe()[['mean','min','max','std']]

              mean  min    max        std
Name
Aaban     6.000000  6.0    6.0   0.000000
Aadan     5.750000  5.0    7.0   0.957427
Aadarsh   5.000000  5.0    5.0        NaN
Aaden    17.479592  5.0  158.0  21.154974
Aadhav    6.000000  6.0    6.0        NaN
...            ...  ...    ...        ...
Zyra      6.000000  5.0    8.0   1.154701
Zyrah     5.500000  5.0    6.0   0.707107
Zyren     6.000000  6.0    6.0        NaN
Zyria     5.900000  5.0    7.0   0.737865
Zyriah    6.444444  5.0   10.0   1.666667

[17632 rows x 4 columns]